src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
					<Comment>0.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
					<Comment>0.05</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
					<Comment>0.1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
					<Comment>0.5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
					<Comment>10</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
					<Comment>50</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
					<Comment>100</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры/Forms/ФормаЗаписиИзменениеЦены/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Элементы.ДекорацияСимволВалюты.Заголовок = ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();   
	
	ЗаписьБылЗаписана = Ложь;
	
	Элементы.Упаковка.Видимость = ?(Запись.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Ложь, Истина);
	
	Если НЕ ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.ВидЦен) Тогда
		Запись.Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Запись.СтруктурнаяЕдиница) Тогда
		Запись.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	КонецЕсли; 
	
	ОкруглятьВБольшуюСторону = Запись.ВидЦен.ОкруглятьВБольшуюСторону;
	ПорядокОкругления = Запись.ВидЦен.ПорядокОкругления;
	ПорядкиОкругленияОкр0_01 = Перечисления.ПорядкиОкругления.Окр0_01;	
		
	Если Параметры.ЗначенияЗаполнения.Свойство("ВидЦен") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ВидЦен) Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.Цена;
	КонецЕсли;	
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры   

&НаКлиенте
// Процедура - обработчик события ПередЗакрытием формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЗаписьБылЗаписана Тогда
		Оповестить("ИзмененаЦена", ЗаписьБылЗаписана);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.Цена) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена цена!"); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		ТекущийОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();  		
	НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(ТекущийОбъект.СтруктурнаяЕдиница);
	НаборЗаписей.Отбор.ВидЦен.Установить(ТекущийОбъект.ВидЦен);
	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущийОбъект.Номенклатура);
	НаборЗаписей.Отбор.Упаковка.Установить(ТекущийОбъект.Упаковка);
	НаборЗаписей.Записать();  
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПослеЗаписи формы.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаписьБылЗаписана = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - Цена при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Запись.Цена = ОкруглитьЦену(Запись.Цена, ПорядокОкругления, ОкруглятьВБольшуюСторону);
	УстановитьФокусЭлементаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура Дополнитьльно(Команда)
	
	 Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Округляет число по заданному порядку.
//
// Параметры:
//  Число        - Число, которое необходимо округлить
//  ПорядокОкругления - Перечисления.ПорядкиОкругления - порядок округления
//  ОкруглятьВБольшуюСторону - Булево - округления в большую сторону.
//
// Возвращаемое значение:
//  Число        - результат округления.
//
Функция ОкруглитьЦену(Число, ПравилоОкругления, ОкруглятьВБольшуюСторону)
	
	Перем Результат; // Возвращаемый результат.
	
	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	Если НЕ ЗначениеЗаполнено(ПравилоОкругления) Тогда
		ПорядокОкругления = ПорядкиОкругленияОкр0_01; 
	Иначе
		ПорядокОкругления = ПравилоОкругления;
	КонецЕсли;
	Порядок = Число(Строка(ПорядокОкругления));
	
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
	
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
	
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону Тогда
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал, 0, РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОкруглитьЦену()

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКнопкаСохранитьИЗакрыть;
	
КонецПроцедуры

#КонецОбласти
